import pyautogui
print(pyautogui.position())  # выведет текущие координаты курсора

#2000, y=450
#Point(x=1319, y=434) левая
# выбор сложности x=1435, y=481
# начать игру (x=2301, y=1292)

#ITEM_POSITIONS = [
 #   (1317, 429),  # Точка 1
  ## (2152, 295)  # Точка закрытия
#]

# Точка база на мини карте x80, y 1207
# Точка башни Point(x=1916, y=840)
# Точка трона x=1527, y=785
# Точка подтверждения победы над рошей 1337 y 1094
# Точка на мини карте для арены x 152 y 1267
# Точка ареса на карте 1566 y 767 (левая кнопка)
# Точка подтвердить вход на арену x1824 y 897
# Точка закрыть выбор x 2152 y 295
# Выбор правой шмотки 1719
# Выход с арены 1281 414
# Подтвердить выход 1088 836
# МПС рестарта 1454 1214
# Подтвердить рестарт 1095 842


# Цвет красной левой #FF0000
# Цвет кнопки подтверждения победы над рошей #0000FF
# Точка левой красной x1320 y 431
# Точка правой красной x2016 y 438
# Точка открытия магазина x2208 y 1398
# Точка покупки топора 2390 449
# Выход с арены 1267 426
# Подтвердить выход 1088 836